# การแปลงข้อมูล
# Fundamental
# แปลงข้อมูลใดๆ เป็น string ใช้ฟังก์ชัน str( )
# แปลงข้อมูล string เป็น number 
# -> เลขจำนวนเต็มใช้ฟังก์ชัน int( )
# -> เลขจำนวนทศนิยมใช้ฟังก์ชัน float( )
# ************************************
# print() แสดงผลข้อมูล
# input() รับข้อมูลที่เป็น string เท่านั้น
# ************************************
# สร้างโปรแกรมคำนวณเงินเดือนสุทธิที่ต้องจ่ายหลังจากหักภาษีแล้ว 7% ของเงินเดือน  และหักค่าประกันสังคม 3% ของเงินเดือน
# โดยรับค่ารหัสพนักงาน ชื่อพนักงาน เงินเดือน ทางแป้นพิมพ์ และแสดงผลข้อมูลที่รับมา
# พร้อมกับรายละเอียดว่าต้องเสียภาษีกี่บาท หักค่าประกันสังคมกี่บาท และต้องจ่ายเงินเดือนสุทธิกี่บาท
print('------------------------------')
print('--- โปรแกรมคํานวณเงินเดือนสุทธิ ---')
print('------------------------------')
emp_id = input('ป้อนรหัสพนักงาน : ')
emp_name = input('ป้อนชื่อพนักงาน : ')
emp_salary = float( input('ป้อนเงินเดือน : ') )
print('------------------------------')
emp_tax = emp_salary * 7 / 100
emp_insur = emp_salary * 3 / 100
emp_salary_total = emp_salary - emp_tax - emp_insur
print(f'รหัสพนักงาน : {emp_id} คุณ {emp_name}')
print(f'เงินเดือนก่อนหักค่าใช้จ่าย : {emp_salary} บาท')
print(f'เงินเดือนหักภาษี 7% : {emp_tax} บาท')
print(f'เงินเดือนหักประกันสังคม 3% : {emp_insur} บาท')
print(f'เงินเดือนสุทธิที่ได้รับ : {emp_salary_total} บาท')
print('------------------------------')
# ใช้เมธอด format
print('รหัสพนักงาน : {} คุณ {}'.format(emp_id,emp_name))
print('เงินเดือนก่อนหักค่าใช้จ่าย : {} บาท'.format(emp_salary))
print('เงินเดือนหักภาษี 3% : {1:,.2f}` บาท 7% : {0:,.2f} บาท'.format(emp_tax, emp_insur))
print('เงินเดือนหักประกันสังคม 3% : {} บาท'.format(emp_insur))
print('เงินเดือนสุทธิที่ได้รับ : {} บาท'.format(emp_salary_total))
print('------------------------------')
# ใช้เมธอด ,
print('รหัสพนักงาน : ', emp_id, ' คุณ ', emp_name)
print('เงินเดือนก่อนหักค่าใช้จ่าย : ', emp_salary, ' บาท')
print('')
print('')
print('')
print('------------------------------')
# ใช้เมธอด +
print('')
print('')
print('')
print('')
print('')
print('------------------------------')