# ทำโปรแกรมสอบถามข้อมูลสายรถเมล์ โดยให้ป้อนสายรถเมล์ที่ต้องการ และแสดงผลข้อมูลว่าไปไหน
# 84 แสดงข้อความไป อ้อมน้อย วัดไร่ขิง
# 81    ...        พรานนก ศิริราช 
# 80    ...        สนามหลวง บางขุนนนท์ ปิ่นเกล้า
# 8     ...        สะพานพุทธ เดอะมอล์บางกะปิ
# 7     ...        คลองเตย พระประแดง
# สายอื่นๆ ให้แสดงข้อความ ยังไม่มีข้อมูล
print('##############################')
print('  โปรแกรมสอบถามข้อมูลสายรถเมล์')
print('##############################')
bus_number = input('ป้อนสายรถเมล์ : ')
print('##############################')
if bus_number == '84' :
    print('อ้อมน้อย วัดไร่ขิง ....')
elif bus_number == '81' :
    print('พรานนก ศิริราช ....')
elif bus_number == '80' :
    print('สนามหลวง บางขุนนนท์ ปิ่นเกล้า ....')
elif bus_number == '8' :
    print('สะพานพุทธ เดอะมอล์บางกะปิ ....')
elif bus_number == '7' :
    print('คลองเตย พระประแดง ....')
else :
    print('ยังไม่มีข้อมูล')
print('##############################')
print()