# ทำโปรแกรมคิดค่า Commission สำหรับพนักงานขาย โดยให้ป้อนชื่อพนักงาน และยอดขาดทางแป้นพิมพ์
# และแสดงผลข้อมูลที่ป้อนและที่คำนวณได้ทางหน้าจอ โดย ค่า Commission คิดจากยอดขาย
# - ยอดขายไม่เกิน 100000 คิดค่าคอม 10% ของยอดขาย
# - เมื่อยอดขายมากกว่า 100000 คิดค่าคอม 15% ของยอดขาย

print('+++++++++++++++++++++++++++')
print('  โปรแกรมคิดค่า Commission')
print('+++++++++++++++++++++++++++')
emp_name = input('ป้อนชื่อพนักงาน : ')
emp_sale = float( input('ป้อนยอดขาย : ') )
print('+++++++++++++++++++++++++++')
if emp_sale <= 100000 :
    commission = emp_sale * 10 / 100
else :
    commission = emp_sale * 15 / 100

print(f'คุณ {emp_name} ยอดขาย {emp_sale} บาท ได้รับค่าคอมมิชชั่นเป็น {commission:,.2f} บาท')
print('+++++++++++++++++++++++++++')